#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/l00163105/l00163105-workspace/runs/run-vtx7DDJC1cmjgbNT

Waiting for the plan to start...

Terraform v1.0.0
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.database.random_string.db_password: Refreshing state... [id=H4QS7sXu7JEMt92V]
module.networking.aws_vpc.main: Refreshing state... [id=vpc-0a6e4172832984cb9]
module.networking.aws_eip.nat_elastic_ip: Refreshing state... [id=eipalloc-041657cb6fc6534fc]
module.security.aws_security_group.app_sg: Refreshing state... [id=sg-08daa52c5d006984d]
module.networking.aws_subnet.private_subnet_dbase_2: Refreshing state... [id=subnet-0cdc1c6b3bb819b87]
module.networking.aws_subnet.private_subnet_dbase_1: Refreshing state... [id=subnet-09b64b114b584714b]
module.security.aws_security_group.general_sg: Refreshing state... [id=sg-094d834e6145a196d]
module.networking.aws_internet_gateway.inet_gateway: Refreshing state... [id=igw-09c42dae20d5ab7fe]
module.networking.aws_subnet.private_subnet_app: Refreshing state... [id=subnet-038a2a267ff4f279a]
module.networking.aws_subnet.public_subnet: Refreshing state... [id=subnet-09a7b7e81df887e42]
module.security.aws_security_group.dbase_sg: Refreshing state... [id=sg-004088f7cb64f5881]
module.networking.aws_route_table.public_routing_table: Refreshing state... [id=rtb-0e707c01f47410137]
module.security.aws_security_group_rule.out_http_app: Refreshing state... [id=sgrule-3577869561]
module.networking.aws_nat_gateway.nat_gateway: Refreshing state... [id=nat-02bd9a09f12bbec7a]
module.security.aws_security_group_rule.out_http: Refreshing state... [id=sgrule-1125367530]
module.security.aws_security_group_rule.in_database_from_app: Refreshing state... [id=sgrule-2827258182]
module.security.aws_security_group_rule.out_database_from_app: Refreshing state... [id=sgrule-1081144708]
module.networking.aws_route_table_association.public_routing_table_assoc: Refreshing state... [id=rtbassoc-09ad533b03af8b7cf]
module.networking.aws_route_table.private_routing_table: Refreshing state... [id=rtb-06859f1cd6f31468c]
module.networking.aws_route_table_association.private_routing_table_assoc_dbase_2: Refreshing state... [id=rtbassoc-01ebbfce7b5a61d6c]
module.networking.aws_route_table_association.private_routing_table_assoc_app: Refreshing state... [id=rtbassoc-0a7c5108d01e307f4]
module.networking.aws_route_table_association.private_routing_table_assoc_dbase_1: Refreshing state... [id=rtbassoc-00e2d825c96069d08]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.compute.aws_elastic_beanstalk_application.app_instance will be created
  + resource "aws_elastic_beanstalk_application" "app_instance" {
      + arn         = (known after apply)
      + description = "SmallWindow21"
      + id          = (known after apply)
      + name        = "SmallWindow21"
      + tags_all    = (known after apply)
    }

  # module.compute.aws_elastic_beanstalk_environment.app_instance_environment will be created
  + resource "aws_elastic_beanstalk_environment" "app_instance_environment" {
      + all_settings           = (known after apply)
      + application            = "SmallWindow21"
      + arn                    = (known after apply)
      + autoscaling_groups     = (known after apply)
      + cname                  = (known after apply)
      + cname_prefix           = (known after apply)
      + endpoint_url           = (known after apply)
      + id                     = (known after apply)
      + instances              = (known after apply)
      + launch_configurations  = (known after apply)
      + load_balancers         = (known after apply)
      + name                   = "smallwindow21-dev"
      + platform_arn           = (known after apply)
      + queues                 = (known after apply)
      + solution_stack_name    = "64bit Amazon Linux 2018.03 v2.16.8 running Docker 19.03.13-ce"
      + tags                   = {
          + "Owner"   = "SmallWindow21 Team"
          + "project" = "Small Window 21"
        }
      + tags_all               = {
          + "Owner"   = "SmallWindow21 Team"
          + "project" = "Small Window 21"
        }
      + tier                   = "WebServer"
      + triggers               = (known after apply)
      + version_label          = (known after apply)
      + wait_for_ready_timeout = "20m"

      + setting {
          + name      = "ELBSubnets"
          + namespace = "aws:ec2:vpc"
          + value     = "subnet-09a7b7e81df887e42"
        }
      + setting {
          + name      = "IamInstanceProfile"
          + namespace = "aws:autoscaling:launchconfiguration"
          + value     = (known after apply)
        }
      + setting {
          + name      = "InstanceTypes"
          + namespace = "aws:ec2:instances"
          + value     = "t2.micro"
        }
      + setting {
          + name      = "MaxSize"
          + namespace = "aws:autoscaling:asg"
          + value     = "1"
        }
      + setting {
          + name      = "MinSize"
          + namespace = "aws:autoscaling:asg"
          + value     = "1"
        }
      + setting {
          + name      = "SecurityGroups"
          + namespace = "aws:autoscaling:launchconfiguration"
          + value     = "sg-094d834e6145a196d, sg-08daa52c5d006984d"
        }
      + setting {
          + name      = "SecurityGroups"
          + namespace = "aws:elbv2:loadbalancer"
          + value     = "sg-094d834e6145a196d"
        }
      + setting {
          + name      = "Subnets"
          + namespace = "aws:ec2:vpc"
          + value     = "subnet-038a2a267ff4f279a"
        }
      + setting {
          + name      = "VPCId"
          + namespace = "aws:ec2:vpc"
          + value     = "vpc-0a6e4172832984cb9"
        }
      + setting {
          + name      = "db_address"
          + namespace = "aws:elasticbeanstalk:application:environment"
          + value     = (known after apply)
        }
      + setting {
          + name      = "db_endpoint"
          + namespace = "aws:elasticbeanstalk:application:environment"
          + value     = (known after apply)
        }
      + setting {
          + name      = "db_password"
          + namespace = "aws:elasticbeanstalk:application:environment"
          + value     = "H4QS7sXu7JEMt92V"
        }
      + setting {
          + name      = "db_port"
          + namespace = "aws:elasticbeanstalk:application:environment"
          + value     = (known after apply)
        }
      + setting {
          + name      = "db_username"
          + namespace = "aws:elasticbeanstalk:application:environment"
          + value     = "smallwindow21"
        }
      + setting {
          + name      = "storage_bucket_name"
          + namespace = "aws:elasticbeanstalk:application:environment"
          + value     = (known after apply)
        }
    }

  # module.database.aws_db_instance.db_instance will be created
  + resource "aws_db_instance" "db_instance" {
      + address                               = (known after apply)
      + allocated_storage                     = 10
      + apply_immediately                     = (known after apply)
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_subnet_group_name                  = "smallwindow21-dbsubnet-group"
      + delete_automated_backups              = true
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_version                        = "8.0"
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "smallwindow21db"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + maintenance_window                    = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + name                                  = "smallwindow21db"
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_type                          = (known after apply)
      + tags                                  = {
          + "Name"    = "smallwindow21db"
          + "Owner"   = "SmallWindow21 Team"
          + "project" = "Small Window 21"
        }
      + tags_all                              = {
          + "Name"    = "smallwindow21db"
          + "Owner"   = "SmallWindow21 Team"
          + "project" = "Small Window 21"
        }
      + timezone                              = (known after apply)
      + username                              = "smallwindow21"
      + vpc_security_group_ids                = [
          + "sg-004088f7cb64f5881",
          + "sg-08daa52c5d006984d",
          + "sg-094d834e6145a196d",
        ]
    }

  # module.database.aws_db_subnet_group.db_subnet_group will be created
  + resource "aws_db_subnet_group" "db_subnet_group" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "smallwindow21-dbsubnet-group"
      + name_prefix = (known after apply)
      + subnet_ids  = [
          + "subnet-09b64b114b584714b",
          + "subnet-0cdc1c6b3bb819b87",
        ]
      + tags        = {
          + "Name" = "smallwindow21-dbsubnet-group"
        }
      + tags_all    = {
          + "Name" = "smallwindow21-dbsubnet-group"
        }
    }

  # module.security.aws_iam_instance_profile.eb_profile will be created
  + resource "aws_iam_instance_profile" "eb_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "SmallWindow21-Profile"
      + path        = "/"
      + role        = "SmallWindow21-Role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.security.aws_iam_role.eb_role will be created
  + resource "aws_iam_role" "eb_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "SmallWindow21-Role"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.storage.aws_s3_bucket.storage_bucket will be created
  + resource "aws_s3_bucket" "storage_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "smallwindow21-eu-west-1-641469155832"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name"    = "smallwindow21-eu-west-1-641469155832"
          + "Owner"   = "SmallWindow21 Team"
          + "project" = "Small Window 21"
        }
      + tags_all                    = {
          + "Name"    = "smallwindow21-eu-west-1-641469155832"
          + "Owner"   = "SmallWindow21 Team"
          + "project" = "Small Window 21"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + dbase_instance_address                     = (known after apply)
  + dbase_instance_endpoint                    = (known after apply)
  + dbase_instance_port                        = (known after apply)
  + elasticbeanstalk_app_cname                 = (known after apply)
  + elasticbeanstalk_app_loadbalancer_endpoint = (known after apply)
  + storage_bucket_name                        = (known after apply)

```

</details>

*Pusher: @L00163105, Action: `pull_request`*